Revit 2027 API
TextEditorOptions.GetTextEditorOptions Method
 Returns the current Revit instance's TextEditorOptions.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static TextEditorOptions GetTextEditorOptions()
Public Shared Function GetTextEditorOptions As TextEditorOptions
public:
static TextEditorOptions^ GetTextEditorOptions()
static member GetTextEditorOptions : unit -> TextEditorOptions
Return Value
TextEditorOptions
 The TextEditorOptions for the current Revit instance.
See Also
Reference
TextEditorOptions Class
Autodesk.Revit.UI Namespace